ZHH-start/STC8G2K64S4/Libraries/seekfree_peripheral/headfile.h
#ifndef __HEADFILE_H_
#define __HEADFILE_H_

#include "board.h"
#include "common.h"
#include "STC8Gxx.h"
#include "zf_uart.h"
#include "zf_gpio.h"
#include "zf_iic.h"
#include "zf_adc.h"
#include "zf_delay.h"
#include "zf_spi.h"
#include "zf_tim.h"
#include "zf_pwm.h"
#include "zf_exti.h"
#include "zf_nvic.h"
#include "zf_pca_pit.h"
#include "zf_pca_delay.h"
#include "zf_eeprom.h"
#include "zf_mdu16.h"

#include "SEEKFREE_FONT.h"
#include "SEEKFREE_18TFT.h"
#include "SEEKFREE_IIC.h"
#include "SEEKFREE_ICM20602.h"
#include "SEEKFREE_TSL1401.h"
#include "SEEKFREE_IPS114_SPI.h"
#include "SEEKFREE_MPU6050.h"
#include "SEEKFREE_VIRSCO.h"
#include "SEEKFREE_ABSOLUTE_ENCODER.h"
#include "SEEKFREE_WIRELESS.h"
#include "SEEKFREE_PRINTF.h"

#include "drive_oled.h"
#include "drive_5x4keyboard.h"
#include "autodown_interrupt.h"
#include "drive_DHT.h"
#include "drive_Ringtones.h"

#include <string.h>
#include "intrins.h"
#include <stdio.h>

#endif